Курс_Бухгалтерские_задачи/src/Documents/НачислениеАмортизацииОсновныхСредств/НачислениеАмортизацииОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеАмортизацииОсновныхСредств</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Курс_Бухгалтерские_задачи/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Курс_Бухгалтерские_задачи/src/InformationRegisters/СвойстваОсновныхСредств/СвойстваОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваОсновныхСредств</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОсновногоСредства</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МатериальноОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Курс_Бухгалтерские_задачи/src/Enums/СостоянияОсновногоСредства/СостоянияОсновногоСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОсновногоСредства</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
</mdclass:Enum>

Курс_Бухгалтерские_задачи/src/Documents/НачислениеАмортизацииОсновныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Проводки.БлокироватьДляИзменения = Истина;
	Движения.Проводки.Записывать = Истина;
	Движения.Проводки.Записать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Начало", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Окончание", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетПС", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.1"));
	Запрос.УстановитьПараметр("СчетАМ", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СвойстваОС.Состояние КАК Состояние,
	|	СвойстваОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ЕСТЬNULL(ОстаткиПС.СуммаОстаток, 0) КАК СуммаПС,
	|	ЕСТЬNULL(ОстаткиАМ.СуммаОстаток, 0) КАК СуммаАМ,
	|	ВЫРАЗИТЬ(ОстаткиПС.СуммаОстаток / СвойстваОС.СрокПолезногоИспользования КАК ЧИСЛО(10, 2)) КАК СуммаАмортизации,
	|	ЕСТЬNULL(ОборотыАМ.СуммаОборотКт, 0) КАК СуммаОборотКт,
	|	ОстаткиПС.Подразделение,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СвойстваОсновныхСредствСрезПервых.Период, МЕСЯЦ), &Начало, МЕСЯЦ) КАК МесяцевВведено
	|ИЗ
	|	РегистрСведений.СвойстваОсновныхСредств.СрезПоследних(&Период, Организация = &Организация) КАК СвойстваОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Проводки.Остатки(&Период, Счет = &СчетПС, , Организация = &Организация) КАК ОстаткиПС
	|		ПО СвойстваОС.ОсновноеСредство = ОстаткиПС.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Проводки.Остатки(&Период, Счет = &СчетАМ, , Организация = &Организация) КАК ОстаткиАМ
	|		ПО СвойстваОС.ОсновноеСредство = ОстаткиАМ.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Проводки.Обороты(&Начало, &Окончание, Месяц, Счет = &СчетАМ, , Организация = &Организация, , ) КАК ОборотыАМ
	|		ПО СвойстваОС.ОсновноеСредство = ОборотыАМ.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваОсновныхСредств.СрезПервых(
	|				,
	|				Организация = &Организация
	|					И Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОсновногоСредства.Используется)) КАК СвойстваОсновныхСредствСрезПервых
	|		ПО СвойстваОС.ОсновноеСредство = СвойстваОсновныхСредствСрезПервых.ОсновноеСредство
	|ГДЕ
	|	СвойстваОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОсновногоСредства.Используется)";
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаОборотКт < Выборка.СуммаАмортизации 
			И Выборка.СуммаПС + Выборка.СуммаАМ > 0 
			И Выборка.МесяцевВведено > 0 Тогда
			Движение = Движения.Проводки.Добавить();
			Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
			Движение.СчетКт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2");
			БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 1, Выборка.ОсновноеСредство);
			Движение.Период = КонецМесяца(Дата);
			Движение.Организация = Организация;
			Движение.ПодразделениеКт = Выборка.Подразделение;
			Движение.Сумма = Выборка.СуммаАмортизации - Выборка.СуммаОборотКт;
			Движение.Содержание = "Начислена амортизация";
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры
